//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] PasswordEncryptionAlgorithm.uni
// [Description] Define Encryption Algorithm option.
// [Author] Jasmine Jiang
// [Date] 20210426
//******************************************************************************
/=#
#include "VFR.uni"
#langdef   zh-chs "中文 (简体)"
//XCradle-LZQ20230208V001-Add-Start
#string STR_ENCODE_PROMPT            #language eng "Encryption Algorithm"
                                     #language zh-chs "加密算法"
#string STR_ENCODE_HELP              #language eng "Select Password Encryption Algorithm.\n"
                                           "It can be modified only when the password is cleared."
                                     #language zh-chs "选择密码加密算法。\n"
                                     "只有当密码被清除时,它才能被修改。"
#string STR_ENCODE_SHA512            #language eng "SHA512"
#string STR_ENCODE_SHA384            #language eng "SHA384"
#string STR_ENCODE_SHA256            #language eng "SHA256"

#string STR_OEM_MESSAGE_BOX_TITLE    #language eng " Warning!!! "
                                     #language zh-chs "警告！！！"
#string STR_OEM_MESSAGE_BOX_MSG      #language eng "The password already exists. Altering the algorithm value is prohibited!"
                                     #language zh-chs "密码已经存在。禁止改变算法值!"
//XCradle-LZQ20230208V001-Add-End


//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************